; domain
( define ( domain grid-visit-all ) ( :requirements :typing ) ( :types place - object ) ( :predicates ( connected ?x ?y - place ) ( at-robot ?x - place ) ( visited ?x - place ) ) ( :action move :parameters ( ?curpos ?nextpos - place ) :precondition ( and ( at-robot ?curpos ) ( connected ?curpos ?nextpos ) ) :effect ( and ( at-robot ?nextpos ) ( visited ?nextpos ) ) ) )

; problem
(define (problem grid-4)
(:domain grid-visit-all)
(:objects 
	loc-x0-y0
	loc-x0-y1
	loc-x0-y2
	loc-x0-y3
	loc-x1-y0
	loc-x1-y1
	loc-x1-y2
	loc-x1-y3
	loc-x2-y0
	loc-x2-y1
	loc-x2-y2
	loc-x2-y3
	loc-x3-y0
	loc-x3-y1
	loc-x3-y2
	loc-x3-y3
- place 
        
)
(:init
	(at-robot loc-x1-y1)
	(visited loc-x1-y1)
	(connected loc-x0-y0 loc-x1-y0)
 	(connected loc-x0-y0 loc-x0-y1)
 	(connected loc-x0-y1 loc-x1-y1)
 	(connected loc-x0-y1 loc-x0-y0)
 	(connected loc-x0-y1 loc-x0-y2)
 	(connected loc-x0-y2 loc-x1-y2)
 	(connected loc-x0-y2 loc-x0-y1)
 	(connected loc-x0-y2 loc-x0-y3)
 	(connected loc-x0-y3 loc-x1-y3)
 	(connected loc-x0-y3 loc-x0-y2)
 	(connected loc-x1-y0 loc-x0-y0)
 	(connected loc-x1-y0 loc-x2-y0)
 	(connected loc-x1-y0 loc-x1-y1)
 	(connected loc-x1-y1 loc-x0-y1)
 	(connected loc-x1-y1 loc-x2-y1)
 	(connected loc-x1-y1 loc-x1-y0)
 	(connected loc-x1-y1 loc-x1-y2)
 	(connected loc-x1-y2 loc-x0-y2)
 	(connected loc-x1-y2 loc-x2-y2)
 	(connected loc-x1-y2 loc-x1-y1)
 	(connected loc-x1-y2 loc-x1-y3)
 	(connected loc-x1-y3 loc-x0-y3)
 	(connected loc-x1-y3 loc-x2-y3)
 	(connected loc-x1-y3 loc-x1-y2)
 	(connected loc-x2-y0 loc-x1-y0)
 	(connected loc-x2-y0 loc-x3-y0)
 	(connected loc-x2-y0 loc-x2-y1)
 	(connected loc-x2-y1 loc-x1-y1)
 	(connected loc-x2-y1 loc-x3-y1)
 	(connected loc-x2-y1 loc-x2-y0)
 	(connected loc-x2-y1 loc-x2-y2)
 	(connected loc-x2-y2 loc-x1-y2)
 	(connected loc-x2-y2 loc-x3-y2)
 	(connected loc-x2-y2 loc-x2-y1)
 	(connected loc-x2-y2 loc-x2-y3)
 	(connected loc-x2-y3 loc-x1-y3)
 	(connected loc-x2-y3 loc-x3-y3)
 	(connected loc-x2-y3 loc-x2-y2)
 	(connected loc-x3-y0 loc-x2-y0)
 	(connected loc-x3-y0 loc-x3-y1)
 	(connected loc-x3-y1 loc-x2-y1)
 	(connected loc-x3-y1 loc-x3-y0)
 	(connected loc-x3-y1 loc-x3-y2)
 	(connected loc-x3-y2 loc-x2-y2)
 	(connected loc-x3-y2 loc-x3-y1)
 	(connected loc-x3-y2 loc-x3-y3)
 	(connected loc-x3-y3 loc-x2-y3)
 	(connected loc-x3-y3 loc-x3-y2)
 
)
(:goal
(and 
	(visited loc-x0-y0)
	(visited loc-x0-y1)
	(visited loc-x0-y2)
	(visited loc-x0-y3)
	(visited loc-x1-y0)
	(visited loc-x1-y1)
	(visited loc-x1-y2)
	(visited loc-x1-y3)
	(visited loc-x2-y0)
	(visited loc-x2-y1)
	(visited loc-x2-y2)
	(visited loc-x2-y3)
	(visited loc-x3-y0)
	(visited loc-x3-y1)
	(visited loc-x3-y2)
	(visited loc-x3-y3)
)
)
)

; plan
1. (move loc-x1-y1 loc-x0-y1)
   added: (at-robot loc-x0-y1) (visited loc-x0-y1)
   goals met: 2 of 16
2. (move loc-x0-y1 loc-x0-y0)
   added: (at-robot loc-x0-y0) (visited loc-x0-y0)
   goals met: 3 of 16
3. (move loc-x0-y0 loc-x1-y0)
   added: (at-robot loc-x1-y0) (visited loc-x1-y0)
   goals met: 4 of 16
4. (move loc-x1-y0 loc-x2-y0)
   added: (at-robot loc-x2-y0) (visited loc-x2-y0)
   goals met: 5 of 16
5. (move loc-x2-y0 loc-x2-y1)
   added: (at-robot loc-x2-y1) (visited loc-x2-y1)
   goals met: 6 of 16
6. (move loc-x2-y1 loc-x2-y2)
   added: (at-robot loc-x2-y2) (visited loc-x2-y2)
   goals met: 7 of 16
7. (move loc-x2-y2 loc-x1-y2)
   added: (at-robot loc-x1-y2) (visited loc-x1-y2)
   goals met: 8 of 16
8. (move loc-x1-y2 loc-x0-y2)
   added: (at-robot loc-x0-y2) (visited loc-x0-y2)
   goals met: 9 of 16
9. (move loc-x0-y2 loc-x0-y3)
   added: (at-robot loc-x0-y3) (visited loc-x0-y3)
   goals met: 10 of 16
10. (move loc-x0-y3 loc-x1-y3)
   added: (at-robot loc-x1-y3) (visited loc-x1-y3)
   goals met: 11 of 16
11. (move loc-x1-y3 loc-x2-y3)
   added: (at-robot loc-x2-y3) (visited loc-x2-y3)
   goals met: 12 of 16
12. (move loc-x2-y3 loc-x3-y3)
   added: (at-robot loc-x3-y3) (visited loc-x3-y3)
   goals met: 13 of 16
13. (move loc-x3-y3 loc-x3-y2)
   added: (at-robot loc-x3-y2) (visited loc-x3-y2)
   goals met: 14 of 16
14. (move loc-x3-y2 loc-x3-y1)
   added: (at-robot loc-x3-y1) (visited loc-x3-y1)
   goals met: 15 of 16
15. (move loc-x3-y1 loc-x3-y0)
   added: (at-robot loc-x3-y0) (visited loc-x3-y0)
   goals met: 16 of 16
